; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-3-4-7-7-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 distributor0)
	(clear pallet4)
	(at pallet5 distributor1)
	(clear crate1)
	(at pallet6 distributor2)
	(clear crate2)
	(at truck0 distributor0)
	(at truck1 distributor2)
	(at truck2 distributor1)
	(at truck3 depot3)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at crate0 distributor2)
	(on crate0 pallet6)
	(at crate1 distributor1)
	(on crate1 pallet5)
	(at crate2 distributor2)
	(on crate2 crate0)
)

(:goal (and
		(on crate0 pallet1)
		(on crate1 pallet0)
	)
))

; plan
1. (lift hoist6 crate2 crate0 distributor2)
   deleted: (at crate2 distributor2) (available hoist6) (on crate2 crate0) (clear crate2)
   added: (lifting hoist6 crate2) (clear crate0)
   goals met: 0 of 2
2. (load hoist6 crate2 truck1 distributor2)
   deleted: (lifting hoist6 crate2)
   added: (in crate2 truck1) (available hoist6)
   goals met: 0 of 2
3. (lift hoist6 crate0 pallet6 distributor2)
   deleted: (at crate0 distributor2) (available hoist6) (on crate0 pallet6) (clear crate0)
   added: (lifting hoist6 crate0) (clear pallet6)
   goals met: 0 of 2
4. (load hoist6 crate0 truck1 distributor2)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck1) (available hoist6)
   goals met: 0 of 2
5. (lift hoist5 crate1 pallet5 distributor1)
   deleted: (at crate1 distributor1) (available hoist5) (on crate1 pallet5) (clear crate1)
   added: (lifting hoist5 crate1) (clear pallet5)
   goals met: 0 of 2
6. (load hoist5 crate1 truck2 distributor1)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck2) (available hoist5)
   goals met: 0 of 2
7. (drive truck2 distributor1 depot0)
   deleted: (at truck2 distributor1)
   added: (at truck2 depot0)
   goals met: 0 of 2
8. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 0 of 2
9. (unload hoist0 crate1 truck2 depot0)
   deleted: (available hoist0) (in crate1 truck2)
   added: (lifting hoist0 crate1)
   goals met: 0 of 2
10. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   goals met: 1 of 2
11. (unload hoist1 crate0 truck1 depot1)
   deleted: (available hoist1) (in crate0 truck1)
   added: (lifting hoist1 crate0)
   goals met: 1 of 2
12. (drop hoist1 crate0 pallet1 depot1)
   deleted: (lifting hoist1 crate0) (clear pallet1)
   added: (at crate0 depot1) (available hoist1) (on crate0 pallet1) (clear crate0)
   goals met: 2 of 2
